In [1]:
import pandas as pd

>pandas 를 import 하고 ps 라는 단축어로 사용
---

In [2]:
friends = [
    {'age' : 15, 'job' : 'student'},
    {'age' : 25, 'job' : 'developer'},
    {'age' : 30, 'job' : 'teacher'}
]
pd.DataFrame(friends, index = ['John', 'Jenny', 'Nate'], columns = ['age', 'job'])

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

>pd.DataFrame(friends, index = ['John', 'Jenny', 'Nate'], columns = ['age', 'job']) \
>= pd.DataFrame(friends, ['John', 'Jenny', 'Nate'], ['age', 'job'])

In [4]:
df = pd.DataFrame(friends, index = ['John', 'Jenny', 'Nate'], columns = ['age', 'job'])

>friends DataFrame 생성
---

## *.drop('index name')

In [5]:
df.drop(['John','Nate'])

       age        job
Jenny   25  developer

>index = 'Jane', 'Nate 를 제외하고 검색
---

In [6]:
df.drop(['John','Nate'], inplace = True)

In [7]:
df

       age        job
Jenny   25  developer

>index = ['Jane', 'Nate'] 인 row를 제외하고 검색 \
>inplace = True : 변경한 내용 자동 저장
---

In [8]:
friends = [
    {'name' : 'John', 'age' : 15, 'job' : 'student'},
    {'name' : 'Ben','age' : 25, 'job' : 'developer'},
    {'name' : 'Jenny','age' : 30, 'job' : 'teacher'}
]
pd.DataFrame(friends, columns = ['name', 'age', 'job'])

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [16]:
df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])

In [10]:
df.drop(df.index[[0,2]])

  name  age        job
1  Ben   25  developer

>index[0]과 index[2]를 제외하고 검색
---

In [11]:
df[df.age >20]

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

>조건(age >20)에 맞는 column 의 row 만 검색
---

In [12]:
df.drop('age', axis = 1)

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

> row 1의 값들 중(axis = 1) 값이 'age' 인 column 을 제외하고 검색
---

In [13]:
df.drop('job', axis = 1, inplace = True)

In [14]:
df

    name  age
0   John   15
1    Ben   25
2  Jenny   30

> row 1의 값들 중(axis = 1) 값이 'job' 인 column 을 제외하고 검색 \
>inplace = True : 변경한 내용 자동 저장
---